# GetSelectedElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..GetSelectedElementIds Method
NavisworksExportOptions Class See Also
---
Returns the element ids of the elements to export. Empty by default.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ICollection<ElementId> GetSelectedElementIds()
```

Visual Basic
---
```text
Public Function GetSelectedElementIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetSelectedElementIds()
```

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace